#+TITLE: Propositional Truncation
#+NAME: PropTrunc
#+AUTHOR: Johann Rosain

** Mere equality
A mere equality is the propositional truncation of an equality.
#+begin_src ctt
  mere-eq (A : U) (x y : A) : U =
    Prop-trunc (Path A x y)

  mere-eq/Prop (A : U) (x y : A) : UU-Prop =
    Prop-trunc/Prop (Path A x y)
#+end_src
Of course, mere equality is still an equivalence relation.
#+begin_src ctt
  mere-eq/refl (A : U) (x : A) : mere-eq A x x =
    Prop-trunc/unit (refl A x)

  mere-eq/sym (A : U) (x y : A) : (p : mere-eq A x y) -> mere-eq A y x =
    rec-Prop-trunc
      ( Path A x y)
      ( mere-eq/Prop A y x)
      ( \ p. Prop-trunc/unit (inv A x y p))

  mere-eq/trans (A : U) (x y : A) (p : mere-eq A x y) (z : A) (q : mere-eq A y z) : mere-eq A x z =
    rec-Prop-trunc
      ( Path A x y)
      ( mere-eq/Prop A x z)
      ( \ p'. rec-Prop-trunc
              ( Path A y z)
              ( mere-eq/Prop A x z)
              ( \ q'. Prop-trunc/unit (comp A x y p' z q')) q) p
#+end_src
In fact, it is an equivalence relation.
#+begin_src ctt
  mere-eq/Eq-Rel (A : U) : Eq-Rel A =
    ( mere-eq/Prop A,
      ( mere-eq/refl A,
        ( mere-eq/sym A,
          \ x y z p. mere-eq/trans A x y p z)))
#+end_src

#+RESULTS:
: Typecheck has succeeded.

** Closure under \Sigma-type
We have that || \Sigma_{(x: A)}B(x) || is equivalent to || \Sigma_{x: A} ||B(x)|| ||.
#+begin_src ctt
  Prop-trunc/closed-Sg/map (A : U) (B : A -> U) : Prop-trunc (Sg A (\ x. Prop-trunc (B x))) -> Prop-trunc (Sg A B) =
    rec-Prop-trunc
      ( Sg A (\ x. Prop-trunc (B x)))
      ( Prop-trunc/Prop (Sg A B))
      ( \ t. rec-Prop-trunc
            ( B t.1)
            ( Prop-trunc/Prop (Sg A B))
            ( \ b. Prop-trunc/unit (t.1, b)) t.2)

  Prop-trunc/closed-Sg/inv-map (A : U) (B : A -> U) : Prop-trunc (Sg A B) -> Prop-trunc (Sg A (\ x. Prop-trunc (B x))) =
    rec-Prop-trunc
      ( Sg A B)
      ( Prop-trunc/Prop (Sg A (\ x. Prop-trunc (B x))))
      ( \ t. Prop-trunc/unit (t.1, Prop-trunc/unit t.2))

  Prop-trunc/closed-Sg/right-htpy (A : U) (B : A -> U) : (t : Prop-trunc (Sg A B))
                                      -> Path (Prop-trunc (Sg A B))
                                             (Prop-trunc/closed-Sg/map A B (Prop-trunc/closed-Sg/inv-map A B t)) t =
    ind-Prop-trunc
      ( Sg A B)
      ( \ t. is-prop/Prop-path
            ( Prop-trunc/Prop (Sg A B))
            ( Prop-trunc/closed-Sg/map A B (Prop-trunc/closed-Sg/inv-map A B t)) t)
      ( \ t. refl (Prop-trunc (Sg A B)) (Prop-trunc/unit t))

  Prop-trunc/closed-Sg/left-htpy (A : U) (B : A -> U) : (t : Prop-trunc (Sg A (\ x. Prop-trunc (B x))))
                                     -> Path (Prop-trunc (Sg A (\ x. Prop-trunc (B x))))
                                            (Prop-trunc/closed-Sg/inv-map A B (Prop-trunc/closed-Sg/map A B t)) t =
    ind-Prop-trunc
      ( Sg A (\ x. Prop-trunc (B x)))
      ( \ t. is-prop/Prop-path
            ( Prop-trunc/Prop (Sg A (\ x. Prop-trunc (B x))))
            ( Prop-trunc/closed-Sg/inv-map A B (Prop-trunc/closed-Sg/map A B t)) t)
      ( \ t. ind-Prop-trunc
            ( B t.1)
            ( \ b. is-prop/Prop-path
                  ( Prop-trunc/Prop (Sg A (\ x. Prop-trunc (B x))))
                  ( Prop-trunc/closed-Sg/inv-map A B (Prop-trunc/closed-Sg/map A B (Prop-trunc/unit (t.1, b)))) (Prop-trunc/unit (t.1, b)))
            ( \ b. refl (Prop-trunc (Sg A (\ x. Prop-trunc (B x)))) (Prop-trunc/unit (t.1, Prop-trunc/unit b))) t.2)

  Prop-trunc/closed-Sg (A : U) (B : A -> U) : Equiv (Prop-trunc (Sg A (\ x. Prop-trunc (B x)))) (Prop-trunc (Sg A B)) =
    has-inverse/Equiv
      ( Prop-trunc (Sg A (\ x. Prop-trunc (B x))))
      ( Prop-trunc (Sg A B))
      ( Prop-trunc/closed-Sg/map A B)
      ( Prop-trunc/closed-Sg/inv-map A B,
        ( Prop-trunc/closed-Sg/right-htpy A B,
          Prop-trunc/closed-Sg/left-htpy A B))
#+end_src

#+RESULTS:
: Typecheck has succeeded.

** Map out of \Pi-type

   #+begin_src ctt
  Prop-trunc/Pi/map-out (A : U) (B : A -> U) (g : Prop-trunc ((x : A) -> B x)) (x : A) : Prop-trunc (B x) =
    rec-Prop-trunc
      ( (y : A) -> B y)
      ( Prop-trunc/Prop (B x))
      ( \ f. Prop-trunc/unit (f x)) g
   #+end_src

#+RESULTS:
: Typecheck has succeeded.
